{"class_name": "BaselineModel2", "config": {"name": "baselinemodel2_4", "layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "Embedding", "class_name": "Embedding", "config": {"name": "Embedding", "trainable": false, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 12207, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "conv1d_12", "class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "filters": 200, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Embedding", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "filters": 200, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Embedding", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "filters": 200, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Embedding", 0, 0, {}]]]}, {"name": "global_max_pooling1d_12", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_12", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"name": "global_max_pooling1d_11", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_11", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"name": "global_max_pooling1d_10", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_10", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["global_max_pooling1d_12", 0, 0, {}], ["global_max_pooling1d_11", 0, 0, {}], ["global_max_pooling1d_10", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "FullyConnected", "class_name": "Dense", "config": {"name": "FullyConnected", "trainable": true, "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["FullyConnected", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}